vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7062.inc
; ===============================================															
; ADuC7062 HEADER FILE REV 1.6															
; ===============================================															
Z_BASE                         EQU       0xFFFF0000
F_BASE                         EQU       0xFFFFF000
MMR_BASE                       EQU       0xFFFF0000
MMR_BASE_LOW                   EQU       0xFFFF0000
MMR_BASE_HIGH                  EQU       0xFFFFF000

; INTERRUPT CONTROLLER

INTBASE                        EQU       0xFFFF0000
IRQSTA                         EQU       0xFFFF0000
IRQSIG                         EQU       0xFFFF0004
IRQEN                          EQU       0xFFFF0008
IRQCLR                         EQU       0xFFFF000C
SWICFG                         EQU       0xFFFF0010
IRQBASE                        EQU       0xFFFF0014
IRQVEC                         EQU       0xFFFF001C
IRQP0                          EQU       0xFFFF0020
IRQP1                          EQU       0xFFFF0024
IRQP2                          EQU       0xFFFF0028
IRQCONN                        EQU       0xFFFF0030
IRQCONE                        EQU       0xFFFF0034
IRQCLRE                        EQU       0xFFFF0038
IRQSTAN                        EQU       0xFFFF003C
FIQSTA                         EQU       0xFFFF0100
FIQSIG                         EQU       0xFFFF0104
FIQEN                          EQU       0xFFFF0108
FIQCLR                         EQU       0xFFFF010C
FIQVEC                         EQU       0xFFFF011C
FIQSTAN                        EQU       0xFFFF013C
Z_IRQSTA                       EQU       IRQSTA    -Z_BASE
Z_IRQSIG                       EQU       IRQSIG    -Z_BASE
Z_IRQEN                        EQU       IRQEN     -Z_BASE
Z_IRQCLR                       EQU       IRQCLR    -Z_BASE
Z_SWICFG                       EQU       SWICFG    -Z_BASE
Z_IRQBASE                      EQU       IRQBASE   -Z_BASE
Z_IRQVEC                       EQU       IRQVEC    -Z_BASE
Z_IRQP0                        EQU       IRQP0     -Z_BASE
Z_IRQP1                        EQU       IRQP1     -Z_BASE
Z_IRQP2                        EQU       IRQP2     -Z_BASE
Z_IRQCONN                      EQU       IRQCONN   -Z_BASE
Z_IRQCONE                      EQU       IRQCONE   -Z_BASE
Z_IRQCLRE                      EQU       IRQCLRE   -Z_BASE
Z_IRQSTAN                      EQU       IRQSTAN   -Z_BASE
Z_FIQSTA                       EQU       FIQSTA    -Z_BASE
Z_FIQSIG                       EQU       FIQSIG    -Z_BASE
Z_FIQEN                        EQU       FIQEN     -Z_BASE
Z_FIQCLR                       EQU       FIQCLR    -Z_BASE
Z_FIQVEC                       EQU       FIQVEC    -Z_BASE
Z_FIQSTAN                      EQU       FIQSTAN   -Z_BASE

T_IRQSTA                       EQU       IRQSTA    -INTBASE   
T_IRQSIG                       EQU       IRQSIG    -INTBASE   
T_IRQEN                        EQU       IRQEN     -INTBASE   
T_IRQCLR                       EQU       IRQCLR    -INTBASE   
T_SWICFG                       EQU       SWICFG    -INTBASE   
T_IRQBASE                      EQU       IRQBASE   -INTBASE   
T_IRQVEC                       EQU       IRQVEC    -INTBASE   
T_IRQP0                        EQU       IRQP0     -INTBASE   
T_IRQP1                        EQU       IRQP1     -INTBASE   
T_IRQP2                        EQU       IRQP2     -INTBASE   
T_IRQCONN                      EQU       IRQCONN   -INTBASE   
T_IRQCONE                      EQU       IRQCONE   -INTBASE   
T_IRQCLRE                      EQU       IRQCLRE   -INTBASE   
T_IRQSTAN                      EQU       IRQSTAN   -INTBASE   
T_FIQSTA                       EQU       FIQSTA    -INTBASE   
T_FIQSIG                       EQU       FIQSIG    -INTBASE   
T_FIQEN                        EQU       FIQEN     -INTBASE   
T_FIQCLR                       EQU       FIQCLR    -INTBASE   
T_FIQVEC                       EQU       FIQVEC    -INTBASE   
T_FIQSTAN                      EQU       FIQSTAN   -INTBASE   

IRQSTA_OFFSET                  EQU       0x0000
IRQSIG_OFFSET                  EQU       0x0004
IRQEN_OFFSET                   EQU       0x0008
IRQCLR_OFFSET                  EQU       0x000C
SWICFG_OFFSET                  EQU       0x0010
IRQBASE_OFFSET                 EQU       0x0014
IRQVEC_OFFSET                  EQU       0x001C
IRQP0_OFFSET                   EQU       0x0020
IRQP1_OFFSET                   EQU       0x0024
IRQP2_OFFSET                   EQU       0x0028
IRQCONN_OFFSET                 EQU       0x0030
IRQCONE_OFFSET                 EQU       0x0034
IRQCLRE_OFFSET                 EQU       0x0038
IRQSTAN_OFFSET                 EQU       0x003C
FIQSTA_OFFSET                  EQU       0x0100
FIQSIG_OFFSET                  EQU       0x0104
FIQEN_OFFSET                   EQU       0x0108
FIQCLR_OFFSET                  EQU       0x010C
FIQVEC_OFFSET                  EQU       0x011C
FIQSTAN_OFFSET                 EQU       0x013C

; REMAP AND SYSTEM CONTROL

REMAPBASE                      EQU       0xFFFF0200
REMAP                          EQU       0xFFFF0220
RSTSTA                         EQU       0xFFFF0230
RSTCLR                         EQU       0xFFFF0234
Z_REMAP                        EQU       REMAP     -Z_BASE
Z_RSTSTA                       EQU       RSTSTA    -Z_BASE
Z_RSTCLR                       EQU       RSTCLR    -Z_BASE

T_REMAP                        EQU       REMAP     -REMAPBASE 
T_RSTSTA                       EQU       RSTSTA    -REMAPBASE 
T_RSTCLR                       EQU       RSTCLR    -REMAPBASE 

REMAP_OFFSET                   EQU       0x0220
RSTSTA_OFFSET                  EQU       0x0230
RSTCLR_OFFSET                  EQU       0x0234

; TIMER 0

T0BASE                         EQU       0xFFFF0320
T0LD                           EQU       0xFFFF0320
T0VAL                          EQU       0xFFFF0324
T0CON                          EQU       0xFFFF0328
T0CLRI                         EQU       0xFFFF032C
T0CAP                          EQU       0xFFFF0330
Z_T0LD                         EQU       T0LD      -Z_BASE
Z_T0VAL                        EQU       T0VAL     -Z_BASE
Z_T0CON                        EQU       T0CON     -Z_BASE
Z_T0CLRI                       EQU       T0CLRI    -Z_BASE
Z_T0CAP                        EQU       T0CAP     -Z_BASE

T_T0LD                         EQU       T0LD      -T0BASE    
T_T0VAL                        EQU       T0VAL     -T0BASE    
T_T0CON                        EQU       T0CON     -T0BASE    
T_T0CLRI                       EQU       T0CLRI    -T0BASE    
T_T0CAP                        EQU       T0CAP     -T0BASE    

T0LD_OFFSET                    EQU       0x0320
T0VAL_OFFSET                   EQU       0x0324
T0CON_OFFSET                   EQU       0x0328
T0CLRI_OFFSET                  EQU       0x032C
T0CAP_OFFSET                   EQU       0x0330

; WAKE UP TIMER

T1BASE                         EQU       0xFFFF0340
T1LD                           EQU       0xFFFF0340
T1VAL                          EQU       0xFFFF0344
T1CON                          EQU       0xFFFF0348
T1CLRI                         EQU       0xFFFF034C
Z_T1LD                         EQU       T1LD      -Z_BASE
Z_T1VAL                        EQU       T1VAL     -Z_BASE
Z_T1CON                        EQU       T1CON     -Z_BASE
Z_T1CLRI                       EQU       T1CLRI    -Z_BASE

T_T1LD                         EQU       T1LD      -T1BASE    
T_T1VAL                        EQU       T1VAL     -T1BASE    
T_T1CON                        EQU       T1CON     -T1BASE    
T_T1CLRI                       EQU       T1CLRI    -T1BASE    

