vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7062.inc
T1LD_OFFSET                    EQU       0x0340
T1VAL_OFFSET                   EQU       0x0344
T1CON_OFFSET                   EQU       0x0348
T1CLRI_OFFSET                  EQU       0x034C

; WATCHDOG TIMER

T2BASE                         EQU       0xFFFF0360
T2LD                           EQU       0xFFFF0360
T2VAL                          EQU       0xFFFF0364
T2CON                          EQU       0xFFFF0368
T2CLRI                         EQU       0xFFFF036C
T2RCFG                         EQU       0xFFFF0370
Z_T2LD                         EQU       T2LD      -Z_BASE
Z_T2VAL                        EQU       T2VAL     -Z_BASE
Z_T2CON                        EQU       T2CON     -Z_BASE
Z_T2CLRI                       EQU       T2CLRI    -Z_BASE
Z_T2RCFG                       EQU       T2RCFG    -Z_BASE

T_T2LD                         EQU       T2LD      -T2BASE    
T_T2VAL                        EQU       T2VAL     -T2BASE    
T_T2CON                        EQU       T2CON     -T2BASE    
T_T2CLRI                       EQU       T2CLRI    -T2BASE    
T_T2RCFG                       EQU       T2RCFG    -T2BASE    

T2LD_OFFSET                    EQU       0x0360
T2VAL_OFFSET                   EQU       0x0364
T2CON_OFFSET                   EQU       0x0368
T2CLRI_OFFSET                  EQU       0x036C
T2RCFG_OFFSET                  EQU       0x0370

; TIMER 3

T3BASE                         EQU       0xFFFF0380
T3LD                           EQU       0xFFFF0380
T3VAL                          EQU       0xFFFF0384
T3CON                          EQU       0xFFFF0388
T3CLRI                         EQU       0xFFFF038C
T3CAP                          EQU       0xFFFF0390
Z_T3LD                         EQU       T3LD      -Z_BASE
Z_T3VAL                        EQU       T3VAL     -Z_BASE
Z_T3CON                        EQU       T3CON     -Z_BASE
Z_T3CLRI                       EQU       T3CLRI    -Z_BASE
Z_T3CAP                        EQU       T3CAP     -Z_BASE

T_T3LD                         EQU       T3LD      -T3BASE    
T_T3VAL                        EQU       T3VAL     -T3BASE    
T_T3CON                        EQU       T3CON     -T3BASE    
T_T3CLRI                       EQU       T3CLRI    -T3BASE    
T_T3CAP                        EQU       T3CAP     -T3BASE    

T3LD_OFFSET                    EQU       0x0380
T3VAL_OFFSET                   EQU       0x0384
T3CON_OFFSET                   EQU       0x0388
T3CLRI_OFFSET                  EQU       0x038C
T3CAP_OFFSET                   EQU       0x0390

; PLL AND OSCILLATOR CONTROL

PLLBASE                        EQU       0xFFFF0400
POWKEY1                        EQU       0xFFFF0404
POWCON0                        EQU       0xFFFF0408
POWKEY2                        EQU       0xFFFF040C
PLLKEY1                        EQU       0xFFFF0410
PLLCON                         EQU       0xFFFF0414
PLLKEY2                        EQU       0xFFFF0418
GP0KEY1                        EQU       0xFFFF0464
GP0CON1                        EQU       0xFFFF0468
GP0KEY2                        EQU       0xFFFF046C
Z_POWKEY1                      EQU       POWKEY1   -Z_BASE
Z_POWCON0                      EQU       POWCON0   -Z_BASE
Z_POWKEY2                      EQU       POWKEY2   -Z_BASE
Z_PLLKEY1                      EQU       PLLKEY1   -Z_BASE
Z_PLLCON                       EQU       PLLCON    -Z_BASE
Z_PLLKEY2                      EQU       PLLKEY2   -Z_BASE
Z_GP0KEY1                      EQU       GP0KEY1   -Z_BASE
Z_GP0CON1                      EQU       GP0CON1   -Z_BASE
Z_GP0KEY2                      EQU       GP0KEY2   -Z_BASE

T_POWKEY1                      EQU       POWKEY1   -PLLBASE   
T_POWCON0                      EQU       POWCON0   -PLLBASE   
T_POWKEY2                      EQU       POWKEY2   -PLLBASE   
T_PLLKEY1                      EQU       PLLKEY1   -PLLBASE   
T_PLLCON                       EQU       PLLCON    -PLLBASE   
T_PLLKEY2                      EQU       PLLKEY2   -PLLBASE   
T_GP0KEY1                      EQU       GP0KEY1   -GPIOBASE  
T_GP0CON1                      EQU       GP0CON1   -GPIOBASE  
T_GP0KEY2                      EQU       GP0KEY2   -GPIOBASE  

POWKEY1_OFFSET                 EQU       0x0404
POWCON0_OFFSET                 EQU       0x0408
POWKEY2_OFFSET                 EQU       0x040C
PLLKEY1_OFFSET                 EQU       0x0410
PLLCON_OFFSET                  EQU       0x0414
PLLKEY2_OFFSET                 EQU       0x0418
GP0KEY1_OFFSET                 EQU       0x0464
GP0CON1_OFFSET                 EQU       0x0468
GP0KEY2_OFFSET                 EQU       0x046C



; ADC INTERFACE REGISTERS

ADCBASE                        EQU       0xFFFF0500
ADCSTA                         EQU       0xFFFF0500
ADCMSKI                        EQU       0xFFFF0504
ADCMDE                         EQU       0xFFFF0508
ADC0CON                        EQU       0xFFFF050C
ADC1CON                        EQU       0xFFFF0510
ADCFLT                         EQU       0xFFFF0514
ADCCFG                         EQU       0xFFFF0518
ADC0DAT                        EQU       0xFFFF051C
ADC1DAT                        EQU       0xFFFF0520
ADC0OF                         EQU       0xFFFF0524
ADC1OF                         EQU       0xFFFF0528
ADC0GN                         EQU       0xFFFF052C
ADC1GN                         EQU       0xFFFF0530
ADCORCR                        EQU       0xFFFF0534
ADCORCV                        EQU       0xFFFF0538
ADCOTH                         EQU       0xFFFF053C
ADCOTHC                        EQU       0xFFFF0540
ADCOTHV                        EQU       0xFFFF0544
ADCOACC                        EQU       0xFFFF0548
ADCOATH                        EQU       0xFFFF054C
IEXCON                         EQU       0xFFFF0570
Z_ADCSTA                       EQU       ADCSTA    -Z_BASE
Z_ADCMSKI                      EQU       ADCMSKI   -Z_BASE
Z_ADCMDE                       EQU       ADCMDE    -Z_BASE
Z_ADC0CON                      EQU       ADC0CON   -Z_BASE
Z_ADC1CON                      EQU       ADC1CON   -Z_BASE
Z_ADCFLT                       EQU       ADCFLT    -Z_BASE
Z_ADCCFG                       EQU       ADCCFG    -Z_BASE
Z_ADC0DAT                      EQU       ADC0DAT   -Z_BASE
Z_ADC1DAT                      EQU       ADC1DAT   -Z_BASE
Z_ADC0OF                       EQU       ADC0OF    -Z_BASE
Z_ADC1OF                       EQU       ADC1OF    -Z_BASE
Z_ADC0GN                       EQU       ADC0GN    -Z_BASE
Z_ADC1GN                       EQU       ADC1GN    -Z_BASE
Z_ADCORCR                      EQU       ADCORCR   -Z_BASE
Z_ADCORCV                      EQU       ADCORCV   -Z_BASE
Z_ADCOTH                       EQU       ADCOTH    -Z_BASE
Z_ADCOTHC                      EQU       ADCOTHC   -Z_BASE
Z_ADCOTHV                      EQU       ADCOTHV   -Z_BASE
Z_ADCOACC                      EQU       ADCOACC   -Z_BASE
Z_ADCOATH                      EQU       ADCOATH   -Z_BASE
Z_IEXCON                       EQU       IEXCON    -Z_BASE

T_ADCSTA                       EQU       ADCSTA    -ADCBASE   
T_ADCMSKI                      EQU       ADCMSKI   -ADCBASE   
T_ADCMDE                       EQU       ADCMDE    -ADCBASE   
T_ADC0CON                      EQU       ADC0CON   -ADCBASE   
T_ADC1CON                      EQU       ADC1CON   -ADCBASE   
T_ADCFLT                       EQU       ADCFLT    -ADCBASE   
T_ADCCFG                       EQU       ADCCFG    -ADCBASE   
T_ADC0DAT                      EQU       ADC0DAT   -ADCBASE   
T_ADC1DAT                      EQU       ADC1DAT   -ADCBASE   
T_ADC0OF                       EQU       ADC0OF    -ADCBASE   
T_ADC1OF                       EQU       ADC1OF    -ADCBASE   
T_ADC0GN                       EQU       ADC0GN    -ADCBASE   
T_ADC1GN                       EQU       ADC1GN    -ADCBASE   
T_ADCORCR                      EQU       ADCORCR   -ADCBASE   
T_ADCORCV                      EQU       ADCORCV   -ADCBASE   
T_ADCOTH                       EQU       ADCOTH    -ADCBASE   
T_ADCOTHC                      EQU       ADCOTHC   -ADCBASE   
T_ADCOTHV                      EQU       ADCOTHV   -ADCBASE   
T_ADCOACC                      EQU       ADCOACC   -ADCBASE   
T_ADCOATH                      EQU       ADCOATH   -ADCBASE   
T_IEXCON                       EQU       IEXCON    -ADCBASE   

