vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7062.inc
ADCSTA_OFFSET                  EQU       0x0500
ADCMSKI_OFFSET                 EQU       0x0504
ADCMDE_OFFSET                  EQU       0x0508
ADC0CON_OFFSET                 EQU       0x050C
ADC1CON_OFFSET                 EQU       0x0510
ADCFLT_OFFSET                  EQU       0x0514
ADCCFG_OFFSET                  EQU       0x0518
ADC0DAT_OFFSET                 EQU       0x051C
ADC1DAT_OFFSET                 EQU       0x0520
ADC0OF_OFFSET                  EQU       0x0524
ADC1OF_OFFSET                  EQU       0x0528
ADC0GN_OFFSET                  EQU       0x052C
ADC1GN_OFFSET                  EQU       0x0530
ADCORCR_OFFSET                 EQU       0x0534
ADCORCV_OFFSET                 EQU       0x0538
ADCOTH_OFFSET                  EQU       0x053C
ADCOTHC_OFFSET                 EQU       0x0540
ADCOTHV_OFFSET                 EQU       0x0544
ADCOACC_OFFSET                 EQU       0x0548
ADCOATH_OFFSET                 EQU       0x054C
IEXCON_OFFSET                  EQU       0x0570

; DAC INTERFACE REGISTERS

DACBASE                        EQU       0xFFFF0600
DACCON                         EQU       0xFFFF0600
DACDAT                         EQU       0xFFFF0604
Z_DACCON                       EQU       DACCON    -Z_BASE
Z_DACDAT                       EQU       DACDAT    -Z_BASE

T_DACCON                       EQU       DACCON    -DACBASE   
T_DACDAT                       EQU       DACDAT    -DACBASE   

DACCON_OFFSET                  EQU       0x0600
DACDAT_OFFSET                  EQU       0x0604

; 450 COMPATIABLE UART CORE REGISTERS

UARTBASE                       EQU       0xFFFF0700
COMTX                          EQU       0xFFFF0700
COMRX                          EQU       0xFFFF0700
COMDIV0                        EQU       0xFFFF0700
COMIEN0                        EQU       0xFFFF0704
COMDIV1                        EQU       0xFFFF0704
COMIID0                        EQU       0xFFFF0708
COMCON0                        EQU       0xFFFF070C
COMCON1                        EQU       0xFFFF0710
COMSTA0                        EQU       0xFFFF0714
COMSTA1                        EQU       0xFFFF0718
COMSCR                         EQU       0xFFFF071C
COMDIV2                        EQU       0xFFFF072C
Z_COMTX                        EQU       COMTX     -Z_BASE
Z_COMRX                        EQU       COMRX     -Z_BASE
Z_COMDIV0                      EQU       COMDIV0   -Z_BASE
Z_COMIEN0                      EQU       COMIEN0   -Z_BASE
Z_COMDIV1                      EQU       COMDIV1   -Z_BASE
Z_COMIID0                      EQU       COMIID0   -Z_BASE
Z_COMCON0                      EQU       COMCON0   -Z_BASE
Z_COMCON1                      EQU       COMCON1   -Z_BASE
Z_COMSTA0                      EQU       COMSTA0   -Z_BASE
Z_COMSTA1                      EQU       COMSTA1   -Z_BASE
Z_COMSCR                       EQU       COMSCR    -Z_BASE
Z_COMDIV2                      EQU       COMDIV2   -Z_BASE

T_COMTX                        EQU       COMTX     -UARTBASE  
T_COMRX                        EQU       COMRX     -UARTBASE  
T_COMDIV0                      EQU       COMDIV0   -UARTBASE  
T_COMIEN0                      EQU       COMIEN0   -UARTBASE  
T_COMDIV1                      EQU       COMDIV1   -UARTBASE  
T_COMIID0                      EQU       COMIID0   -UARTBASE  
T_COMCON0                      EQU       COMCON0   -UARTBASE  
T_COMCON1                      EQU       COMCON1   -UARTBASE  
T_COMSTA0                      EQU       COMSTA0   -UARTBASE  
T_COMSTA1                      EQU       COMSTA1   -UARTBASE  
T_COMSCR                       EQU       COMSCR    -UARTBASE  
T_COMDIV2                      EQU       COMDIV2   -UARTBASE  

COMTX_OFFSET                   EQU       0x0700
COMRX_OFFSET                   EQU       0x0700
COMDIV0_OFFSET                 EQU       0x0700
COMIEN0_OFFSET                 EQU       0x0704
COMDIV1_OFFSET                 EQU       0x0704
COMIID0_OFFSET                 EQU       0x0708
COMCON0_OFFSET                 EQU       0x070C
COMCON1_OFFSET                 EQU       0x0710
COMSTA0_OFFSET                 EQU       0x0714
COMSTA1_OFFSET                 EQU       0x0718
COMSCR_OFFSET                  EQU       0x071C
COMDIV2_OFFSET                 EQU       0x072C

; I2C BUS PERIPHERAL DEVICE 

I2CBASE                        EQU       0xFFFF0900
I2CMCON                        EQU       0xFFFF0900
I2CMSTA                        EQU       0xFFFF0904
I2CMRX                         EQU       0xFFFF0908
I2CMTX                         EQU       0xFFFF090C
I2CMCNT0                       EQU       0xFFFF0910
I2CMCNT1                       EQU       0xFFFF0914
I2CADR0                        EQU       0xFFFF0918
I2CADR1                        EQU       0xFFFF091C
I2CDIV                         EQU       0xFFFF0924
I2CSCON                        EQU       0xFFFF0928
I2CSSTA                        EQU       0xFFFF092C
I2CSRX                         EQU       0xFFFF0930
I2CSTX                         EQU       0xFFFF0934
I2CALT                         EQU       0xFFFF0938
I2CID0                         EQU       0xFFFF093C
I2CID1                         EQU       0xFFFF0940
I2CID2                         EQU       0xFFFF0944
I2CID3                         EQU       0xFFFF0948
I2CFSTA                        EQU       0xFFFF094C
Z_I2CMCON                      EQU       I2CMCON   -Z_BASE
Z_I2CMSTA                      EQU       I2CMSTA   -Z_BASE
Z_I2CMRX                       EQU       I2CMRX    -Z_BASE
Z_I2CMTX                       EQU       I2CMTX    -Z_BASE
Z_I2CMCNT0                     EQU       I2CMCNT0  -Z_BASE
Z_I2CMCNT1                     EQU       I2CMCNT1  -Z_BASE
Z_I2CADR0                      EQU       I2CADR0   -Z_BASE
Z_I2CADR1                      EQU       I2CADR1   -Z_BASE
Z_I2CDIV                       EQU       I2CDIV    -Z_BASE
Z_I2CSCON                      EQU       I2CSCON   -Z_BASE
Z_I2CSSTA                      EQU       I2CSSTA   -Z_BASE
Z_I2CSRX                       EQU       I2CSRX    -Z_BASE
Z_I2CSTX                       EQU       I2CSTX    -Z_BASE
Z_I2CALT                       EQU       I2CALT    -Z_BASE
Z_I2CID0                       EQU       I2CID0    -Z_BASE
Z_I2CID1                       EQU       I2CID1    -Z_BASE
Z_I2CID2                       EQU       I2CID2    -Z_BASE
Z_I2CID3                       EQU       I2CID3    -Z_BASE
Z_I2CFSTA                      EQU       I2CFSTA   -Z_BASE

T_I2CMCON                      EQU       I2CMCON   -I2CBASE   
T_I2CMSTA                      EQU       I2CMSTA   -I2CBASE   
T_I2CMRX                       EQU       I2CMRX    -I2CBASE   
T_I2CMTX                       EQU       I2CMTX    -I2CBASE   
T_I2CMCNT0                     EQU       I2CMCNT0  -I2CBASE   
T_I2CMCNT1                     EQU       I2CMCNT1  -I2CBASE   
T_I2CADR0                      EQU       I2CADR0   -I2CBASE   
T_I2CADR1                      EQU       I2CADR1   -I2CBASE   
T_I2CDIV                       EQU       I2CDIV    -I2CBASE   
T_I2CSCON                      EQU       I2CSCON   -I2CBASE   
T_I2CSSTA                      EQU       I2CSSTA   -I2CBASE   
T_I2CSRX                       EQU       I2CSRX    -I2CBASE   
T_I2CSTX                       EQU       I2CSTX    -I2CBASE   
T_I2CALT                       EQU       I2CALT    -I2CBASE   
T_I2CID0                       EQU       I2CID0    -I2CBASE   
T_I2CID1                       EQU       I2CID1    -I2CBASE   
T_I2CID2                       EQU       I2CID2    -I2CBASE   
T_I2CID3                       EQU       I2CID3    -I2CBASE   
T_I2CFSTA                      EQU       I2CFSTA   -I2CBASE   

